"use script";

while(true){
    let end_num = +prompt(`Цель игры - отгадать целое число, которое "загадал" компьютер. Диапазон секретных чисел начинается с 0. Максимально возможное число определяется игроком. После очередной попытки угадать число компьютер должен указать больше ли или меньше загаданное число, чем то, которое ввёл игрок. Используя эту информацию, игрок должен угадать число за минимальное количество ходов. Ниже введите число, до которого можно загадать секретное число и приступайте к игре! У тебя только 5 попыток!`);
    let num = Math.floor(Math.random() * end_num);
    let nice_try = 1;

    while(true){
        let answer = +prompt(`Введите число от 1 до ${end_num}: `);
        if(num < answer){
            alert("Моё число меньше!");
            nice_try++;
        } else if(num > answer){
            alert("Моё число больше!");
            nice_try++;
        } else if(answer == num){
            alert("Поздравляю, ты угодал число!");
            break;
        }
        if(nice_try == 6){
            alert("Извини но ты проиграл, попробуй еще раз!");
            break;
        }
    }
    alert(`Поздравляю, тебе понадобилось ${nice_try - 1} попыток!`);
    let play_again = prompt("Хотите сыграть еще раз?");
    if(play_again == "нет"){
        alert("хорошо тогда пока!");
        break;
    }
}